trunk/evcpe/testfiles/get_parameter_values.xml

<?xml version="1.0"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
      <soap:Header>
        <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
      </soap:Header>
      <soap:Body>
        <cwmp:GetParameterValues>
  	<cwmp:ParameterNames>
  	  <xsd:string>.a.d</xsd:string>
  	  <xsd:string>.a.b.a</xsd:string>
  	  <xsd:string>.a.b.b</xsd:string>
  	  <xsd:string>.a.b.c</xsd:string>
  	</cwmp:ParameterNames>
        </cwmp:GetParameterValues>
      </soap:Body>
  </soap:Envelope>
